'''Вы разрабатываете программу для анализа успеваемости студентов в университете.
У вас есть выборка с оценками студентов по предмету «Математика» в виде списка math_grades,
где каждый элемент представляет собой оценку одного студента: Math_grades = [85, 90, 78, 92, 88, 85, 76, 98, 94, 87]. 

Рассчитайте выборочное стандартное отклонение оценок студентов с точностью до трех знаков после запятой (введите с разделителем ”,").'''
#выборочное стандартное отклонение
import numpy as np
math_grades = [85, 90, 78, 92, 88, 85, 76, 98, 94, 87]
std = np.std(math_grades, ddof = 1)
print(std)
